app/controllers/deals_controller.rb

SELECT "deals".* FROM "deals"
---
def index
  @deals = Deal.all

SELECT "deals".* FROM "deals" WHERE "deals"."id" = ? LIMIT 1  [["id", "index"]]
---
  def show
    id = params[:id] # retrieve deal ID from URI route
    @deal = Deal.find(id) # Look up deal by unique ID

INSERT INTO "deals" ("category", "contactemail", "contactname", "contactphonenumber", "created_at", "description", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
 def create
   @deal = Deal.create!(params[:deal])

SELECT "deals".* FROM "deals" WHERE "deals"."id" = ? LIMIT 1  [["id", "2"]]
---
  def edit
    @deal = Deal.find params[:id]

SELECT "deals".* FROM "deals" WHERE "deals"."id" = ? LIMIT 1  [["id", "11"]]
UPDATE "deals" SET "category" = 'Books', "price" = '$545', "contactname" = '', "contactemail" = '', "contactphonenumber" = '', "updated_at" = '2015-05-07 00:59:08.957868' WHERE "deals"."id" = 10
---
  def update
    @deal = Deal.find params[:id]
    @deal.update_attributes!(params[:deal])

SELECT "deals".* FROM "deals" WHERE "deals"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "deals" WHERE "deals"."id" = ?  [["id", 1]]
---
  def destroy
    @deal = Deal.find(params[:id])
    @deal.destroy