app/controllers/students_controller.rb

INSERT INTO "students" ("created_at", "emailid", "firstname", "lastname", "password", "phoneno", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
 def create
   @student = Student.new(params[:student])
   flash[:notice] = "User registered successfully"
   if @student.save